Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-reference_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: concurrent-mode-reference title: Concurrent Mode API Reference (Experimental) permalink: docs/concurrent-mode-reference.html prev: concurrent-mode-adoption.html ---
ja: --- id: concurrent-mode-reference title: 並列モード API リファレンス（実験的機能） permalink: docs/concurrent-mode-reference.html prev: concurrent-mode-adoption.html ---

source: >Caution: > >This page was about experimental features that aren't yet available in a stable release. It was aimed at early adopters and people who are curious.
ja: >警告: > > このページはアーリーアダプターや興味のある読者を対象に、安定リリースでまだ利用できない実験的機能を説明するために存在していました。

source: > >Much of the information on this page is now outdated and exists only for archival purposes.
ja: > > このページの説明のほとんどは既に古くなっており、アーカイブの目的のためだけに残しています。

source: **Please refer to the [React 18 Alpha announcement post](/blog/2021/06/08/the-plan-for-react-18.html ) for the up-to-date information.**
ja: 最新の情報については [React 18 アルファのアナウンス](/blog/2021/06/08/the-plan-for-react-18.html)を参照してください。

source: > >Before React 18 is released, we will replace this page with stable documentation.
ja: > > React 18 のリリースまでに、このページはより安定したドキュメントに置き換わる予定です。

source: This page is an API reference for the React [Concurrent Mode](/docs/concurrent-mode-intro.html).
ja: このページは React の[並列モード](/docs/concurrent-mode-intro.html) についての API リファレンスです。

source: If you're looking for a guided introduction instead, check out [Concurrent UI Patterns](/docs/concurrent-mode-patterns.html).
ja: ガイド付きの案内記事を探している場合は、[並列的 UI パターン](/docs/concurrent-mode-patterns.html)を参照してください。

source: **Note: This is a Community Preview and not the final stable version.
ja: **補足：これは公開プレビューであり最終安定板ではありません。

source: There will likely be future changes to these APIs.
ja: これらの API は将来高確率で変更されます。

source: Use at your own risk!**
ja: 自己責任で使ってください！**

source: - [Enabling Concurrent Mode](#concurrent-mode)
ja: - [並列モードの有効化](#concurrent-mode)

source: - [`createRoot`](#createroot) - [Suspense](#suspense)
ja: - [`createRoot`](#createroot) - [サスペンス API](#suspense)

source: ## Enabling Concurrent Mode {#concurrent-mode}
ja: ## 並列モードの有効化 {#concurrent-mode}

source: Replaces `ReactDOM.render(<App />, rootNode)` and enables Concurrent Mode.
ja: `ReactDOM.render(<App />, rootNode)` を置き換えて、並列モードを有効化します。

source: For more information on Concurrent Mode, check out the [Concurrent Mode documentation.](/docs/concurrent-mode-intro.html)
ja: 並列モードについての詳細は[並列モードのドキュメント](/docs/concurrent-mode-intro.html)を参照してください。

source: ## Suspense API {#suspense}
ja: ## サスペンス API {#suspense}

source: `Suspense` lets your components "wait" for something before they can render, showing a fallback while waiting.
ja: `Suspense` により、レンダー可能になる前にコンポーネントが「待機」し、待機中にフォールバックを表示できるようになります。

source: In this example, `ProfileDetails` is waiting for an asynchronous API call to fetch some data.
ja: 上記の例では、`ProfileDetails` は何らかのデータを取得するために非同期 API コールを待機しています。

source: While we wait for `ProfileDetails` and `ProfilePhoto`, we will show the `Loading...` fallback instead.
ja: `ProfileDetails` と `ProfilePhoto` を待機している間、`Loading...` というフォールバックを代わりに表示します。

source: It is important to note that until all children inside `<Suspense>` have loaded, we will continue to show the fallback.
ja: `<Suspense>` 内のすべての子要素がロードされるまでは、フォールバックが表示されつづけることに注意することが重要です。

source: `Suspense` takes two props: * **fallback** takes a loading indicator.
ja: `Suspense` は 2 つの props を受け取ります： * **fallback** はローディングインジケータを受け取ります。

source: The fallback is shown until all of the children of the `Suspense` component have finished rendering.
ja: フォールバックは `Suspense` コンポーネントのすべての子要素がレンダーを完了するまで表示されます。

source: * **unstable_avoidThisFallback** takes a boolean.
ja: * **unstable_avoidThisFallback** は真偽値を受け取ります。

source: It tells React whether to "skip" revealing this boundary during the initial load.
ja: 初回ロード時にこのバウンダリの開放を「スキップ」するかどうかを React に伝えます。

source: This API will likely be removed in a future release.
ja: この API は将来のリリースで高確率で削除されます。

source: `SuspenseList` helps coordinate many components that can suspend by orchestrating the order in which these components are revealed to the user.
ja: `SuspenseList` はサスペンドしうる多数のコンポーネントがユーザに開放される順番を制御することで、それらのコンポーネントが協調してうまく動くようにします。

source: When multiple components need to fetch data, this data may arrive in an unpredictable order.
ja: 複数のコンポーネントがデータを取得する必要がある場合、それらのデータは予測不能な順番で到着するかもしれません。

source: However, if you wrap these items in a `SuspenseList`, React will not show an item in the list until previous items have been displayed (this behavior is adjustable).
ja: しかし、`SuspenseList` でこれらの要素をラップすることで、React は手前にある要素が全て表示されるまで、ある要素を表示しないようになります（この挙動は変更可能です）。

source: `SuspenseList` takes two props: * **revealOrder (forwards, backwards, together)** defines the order in which the `SuspenseList` children should be revealed.
ja: `SuspenseList` は 2 つの props を受け取ります： * **revealOrder (forwards, backwards, together)** は `SuspenseList` の子要素が表示される順番を定義します。

source: * `together` reveals *all* of them when they're ready instead of one by one.
ja: * `together` は 1 つずつではなく、*すべての*子要素を準備完了した時点でまとめて表示します。

source: * **tail (collapsed, hidden)** dictates how unloaded items in a `SuspenseList` is shown.
ja: * **tail (collapsed, hidden)** `SuspenseList` 内のロードされていない要素がどのように表示されるかを記述します。

source: * By default, `SuspenseList` will show all fallbacks in the list.
ja: * デフォルトでは `SuspenseList` はリスト中のすべてのフォールバックを表示します。

source: * `collapsed` shows only the next fallback in the list.
ja: * `collapsed` はリスト内の次のフォールバックのみを表示します。

source: * `hidden` doesn't show any unloaded items.
ja: * `hidden` は未ロードの要素を一切表示しません。

source: Note that `SuspenseList` only operates on the closest `Suspense` and `SuspenseList` components below it.
ja: `SuspenseList` はすぐ直下にある `Suspense` と `SuspenseList` にのみ作用することに気をつけてください。

source: It does not search for boundaries deeper than one level.
ja: 1 階層分より深くまでバウンダリを探しに行くことはしません。

source: However, it is possible to nest multiple `SuspenseList` components in each other to build grids.
ja: しかし、複数の `SuspenseList` を互いにネストさせてグリッドを作ることは可能です。

source: `useTransition` allows components to avoid undesirable loading states by waiting for content to load before **transitioning to the next screen**.
ja: `useTransition` を使うことで、**次の画面に遷移する**前にコンテンツがロードされるのを待機し、コンポーネントが望ましくないロード中状態を表示することを避けられるようになります。

source: It also allows components to defer slower, data fetching updates until subsequent renders so that more crucial updates can be rendered immediately.
ja: また、データ取得に関わる遅い更新を後続するレンダーへと遅延させることで、より重要な更新が即座にレンダーされるようにすることができます。

source: The `useTransition` hook returns two values in an array.
ja: `useTransition` フックは 2 つの値を配列に入れて返します。

source: * `startTransition` is a function that takes a callback.
ja: * `startTransition` はコールバックを受け取る関数です。

source: We can use it to tell React which state we want to defer.
ja: これを使って、React にどの state を遅延させたいのかを伝えることができます。

source: * `isPending` is a boolean.
ja: * `isPending` は真偽値です。

source: It's React's way of informing us whether we're waiting for the transition to finish.
ja: これがトランジションの完了を待っているかどうかを React が伝えてくれる手段です。

source: **If some state update causes a component to suspend, that state update should be wrapped in a transition.**
ja: **何らかの state の更新がコンポーネントのサスペンドを引き起こす場合は、その更新はトランジションでラップされるべきです。**

source: In this code, we've wrapped our data fetching with `startTransition`.
ja: このコードでは、`startTransition` を使ってデータの取得をラップしています。

source: This allows us to start fetching the profile data right away, while deferring the render of the next profile page and its associated `Spinner` for 2 seconds (the time shown in `timeoutMs`).
ja: これにより即座にプロフィールの取得を開始できる一方で、次のプロフィールページとそれに結びついている `Spinner` の表示を 2 秒間（`timeoutMs` に示されている時間）遅延させます。

source: The `isPending` boolean lets React know that our component is transitioning, so we are able to let the user know this by showing some loading text on the previous profile page.
ja: 真偽値である `isPending` によってコンポーネントのトランジションが進行中かどうかを知ることができ、ユーザに前のプロフィールページ内で何らかのロード中テキストを表示してトランジションの進行中状態を伝えることができます。

source: **For an in-depth look at transitions, you can read [Concurrent UI Patterns](/docs/concurrent-mode-patterns.html#transitions).**
ja: **トランジションについての詳細な解説は[並列的 UI パターン](/docs/concurrent-mode-patterns.html#transitions)で読めます。**

source: #### useTransition Config {#usetransition-config}
ja: #### useTransition 設定 {#usetransition-config}

source: `useTransition` accepts an **optional Suspense Config** with a `timeoutMs`.
ja: `useTransition` はオプションで `timeoutMs` 値の入った **Suspense Config** を受け取ります。

source: This timeout (in milliseconds) tells React how long to wait before showing the next state (the new Profile Page in the above example).
ja: このタイムアウト（ミリ秒で指定）は、React に次の state（上記の例では新しいプロフィールページ）を表示するまでにどれだけ待つかを伝えます。

source: **Note: We recommend that you share Suspense Config between different modules.**
ja: **補足：Suspense Config は複数のモジュール間で共有することをお勧めします。**

source: Returns a deferred version of the value that may "lag behind" it for at most `timeoutMs`.
ja: 最大で `timeoutMs` まで「遅れる」ことのできる、遅延されたバージョンの値を返します。

source: This is commonly used to keep the interface responsive when you have something that renders immediately based on user input and something that needs to wait for a data fetch.
ja: ユーザ入力に基づいて即座にレンダーされる何かや、データ取得を待つ必要がある何かがある場合に、インターフェイスをレスポンシブに保つためによく使われます。

source: A good example of this is a text input.
ja: よい例はテキスト入力です。

source: This allows us to start showing the new text for the `input` immediately, which allows the webpage to feel responsive.
ja: これにより `input` が即座に新しいテキストを表示し始めることができ、ウェブページがレスポンシブに保たれます。

source: Meanwhile, `MySlowList` "lags behind" for up to 2 seconds according to the `timeoutMs` before updating, allowing it to render with the current text in the background.
ja: その一方で `MySlowList` は、`timeoutMs` に書かれているとおり更新まで最大 2 秒間遅延されるので、バックグラウンドで現在のテキストの値がレンダーできるようになります。

source: **For an in-depth look at deferring values, you can read [Concurrent UI Patterns](/docs/concurrent-mode-patterns.html#deferring-a-value).**
ja: **値の遅延についての詳細な解説は[並列的 UI パターン](/docs/concurrent-mode-patterns.html#deferring-a-value)で読めます。**

source: #### useDeferredValue Config {#usedeferredvalue-config}
ja: #### useDeferredValue 設定 {#usedeferredvalue-config}

source: `useDeferredValue` accepts an **optional Suspense Config** with a `timeoutMs`.
ja: `useDeferredValue` はオプションで `timeoutMs` 値の入った **Suspense Config** を受け取ります。

source: This timeout (in milliseconds) tells React how long the deferred value is allowed to lag behind.
ja: このタイムアウト（ミリ秒で指定）は、React に遅延される値がどれだけ遅れても構わないのかを伝えます。

source: React will always try to use a shorter lag when network and device allows it.
ja: ネットワークやデバイス性能が許す範囲で、React は常にラグを短くしようとします。
